# Game of Thrones Index/Match Functions
## Search entire spreadsheets (by column or row)
### Source: https://towardsdatascience.com/name-your-favorite-excel-function-and-ill-teach-you-its-pandas-equivalent-7ee4400ada9f

### Goal: Match the last name column in dataframe 2 with correct rows in dataframe 1

## List of Solutions

In [98]:
# load libraries

import pandas as pd 
import random

In [99]:
data_1 = {'id':[1002,1004,1006],
	'first_name':['Cersei','Daenerys','Arya']}

In [100]:
df_1 = pd.DataFrame(data=data_1)
df_1

     id first_name
0  1002     Cersei
1  1004   Daenerys
2  1006       Arya

In [101]:
data_2 = {'id':[1003,1004,1005,1002,1006],
	'last_name':['Tyrell','Targaryen','Snow','Lannister','Stark']}

In [102]:
df_2 = pd.DataFrame(data=data_2)
df_2

     id  last_name
0  1003     Tyrell
1  1004  Targaryen
2  1005       Snow
3  1002  Lannister
4  1006      Stark

In [103]:
# Solution 1: Using.join()
%time
joined_df = df_1.set_index('id').join(df_2.set_index('id'))
joined_df

CPU times: user 3 µs, sys: 1 µs, total: 4 µs
Wall time: 6.91 µs

     first_name  last_name
id
1002     Cersei  Lannister
1004   Daenerys  Targaryen
1006       Arya      Stark

In [104]:
# Solution 2: Using.merge()
%time
merged_df = df_1.merge(df_2, how='left', on='id')
merged_df

CPU times: user 3 µs, sys: 0 ns, total: 3 µs
Wall time: 7.87 µs

     id first_name  last_name
0  1002     Cersei  Lannister
1  1004   Daenerys  Targaryen
2  1006       Arya      Stark

In [105]:
# Solution 3: Using.concat()
%time
concat_df = pd.concat([df_1.set_index('id'), df_2.set_index('id').last_name], axis=1, sort='id', join='inner')
concat_df

CPU times: user 3 µs, sys: 0 ns, total: 3 µs
Wall time: 7.87 µs

     first_name  last_name
id
1002     Cersei  Lannister
1004   Daenerys  Targaryen
1006       Arya      Stark

In [106]:
# Solution 4: Using.map()
%time
df_1['last_name'] = df_1.id.map(df_2.set_index('id')['last_name'].to_dict())
print('data frame 1 after procv')
display(df_1)

CPU times: user 3 µs, sys: 1 µs, total: 4 µs
Wall time: 6.2 µs
data frame 1 after procv

     id first_name  last_name
0  1002     Cersei  Lannister
1  1004   Daenerys  Targaryen
2  1006       Arya      Stark